#include "light.h"


/*********************************************************************************
** 函数名称Light_GPIO_Init
** 编写者  ：CZM
** 函数功能：三色灯端口初始化
** 输入参数：无
** 输出参数：无
** 备    注：无
*********************************************************************************/
void Light_GPIO_Init(void)
{
	GPIO_InitTypeDef   GPIO_InitStructure;
	
	RCC_AHB1PeriphClockCmd(RCC_AHB1Periph_GPIOE,ENABLE);
	
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_12|GPIO_Pin_13;                   //led_test
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_OUT;                          //设置端口为输出模式
	GPIO_InitStructure.GPIO_OType = GPIO_OType_PP;                         //推挽输出
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;                      //设置速度为第三级
	GPIO_Init(GPIOB,&GPIO_InitStructure); 
	
	LED1=0;
}
/*********************************************************************************
** 函数名称Light_Control
** 编写者  ：CZM
** 函数功能：灯带长亮控制
** 输入参数：无
** 输出参数: 无
** 备    注：无
*********************************************************************************/
void Light_Control(void)
{
	
	LED1=!LED1;
	
}
	
/*********************************************************************************
** 函数名称Flash_Control
** 编写者  ：CZM
** 函数功能：灯带闪烁控制
** 输入参数：无
** 输出参数: 无
** 备    注：无
*********************************************************************************/
/*********************************************************************************
** 函数名称Light_Net_Not_Control
** 编写者  ：CZM
** 函数功能：灯带红色亮，没有网络时
** 输入参数：无
** 输出参数: 无
** 备    注：无
*********************************************************************************/


