#include "vocsensor.h"
#include "adc.h"


uchar voc_buffer[VOC_SIZE]={0};

//===============================================================
/*********************************************************************************
** 函数名称: Sum_Nbyte_Check
** 编写者  ：CZM
** 函数功能：调节等离子体强度
** 输入参数：无
** 输出参数：无
** 备    注：无
*********************************************************************************/
//===============================================================
uchar Sum_Nbyte_Check(uchar *buf,uchar n)
{
	 uchar i;
	 u8   sum=0;
	
	 for(i=0;i<n-1;i++)
	 {
		  sum+=buf[i];
	 }
	 
	 
	 return sum;
	 
 }
/*********************************************************************************
** 函数名称: VOC_Receive_Process
** 编写者  ：CZM
** 函数功能：调节等离子体强度
** 输入参数：无
** 输出参数：无
** 备    注：无
*********************************************************************************/
 void VOC_Receive_Process(uchar buf[],uchar n)
 {
	  uchar temp_check=0;
	 
	  if(n>=VOC_SIZE)
	  {
		 
	     memcpy(voc_buffer,buf,n);
		   memset(buf,0,n);
		 
		   temp_check=Sum_Nbyte_Check(voc_buffer,n);
	  }
	  else
	  {
		   return;
	  }
		
		if(voc_buffer[0]==0x5f)
		{
			 if(temp_check==voc_buffer[n-1])
			 {
				  memcpy(sensor.voc.voc_buf,voc_buffer,n);
			 }
			 
		}
		
 }
 
//===============================================================
/*********************************************************************************
** 函数名称: VOC_Receive_Data_Process
** 编写者  ：CZM
** 函数功能：调节等离子体强度
** 输入参数：无
** 输出参数：无
** 备    注：无
*********************************************************************************/
 void VOC_Receive_Data_Process(void)//*10＃，即扩大10倍
 {
		sensor.voc.voc_ppm=sensor.voc.voc_buf[1];
		//sensor.voc.voc_now=sensor.voc.voc_buf[1];
		sensor.voc.voc_ppm<<=8;
		//sensor.voc.voc_now<<=8;
		sensor.voc.voc_ppm|=sensor.voc.voc_buf[2];
		//sensor.voc.voc_now|=sensor.voc.voc_buf[2];
	 
 }
//===============================================================
/*********************************************************************************
** 函数名称: VOC_Send_Initiative_To_Passive
** 编写者  ：CZM
** 函数功能：调节等离子体强度
** 输入参数：无
** 输出参数：无
** 备    注：无
*********************************************************************************/
void VOC_Send_Initiative_To_Passive(uchar buf[],uchar n)//主动转被动
{
	  buf[0]=0xf5;
	  buf[1]=0xf0;
	  buf[2]=0x30;
	  buf[3]=0x15;
	
	  Uart2_Put_Word(buf,n);
}	

//===============================================================
/*********************************************************************************
** 函数名称: VOC_Send_Passive_To_Initiative
** 编写者  ：CZM
** 函数功能：调节等离子体强度
** 输入参数：无
** 输出参数：无
** 备    注：无
*********************************************************************************/
void VOC_Send_Passive_To_Initiative(uchar buf[],uchar n)
{
	  buf[0]=0xf5;
	  buf[1]=0xf0;
	  buf[2]=0x31;
	  buf[3]=0x16;
	
	  Uart2_Put_Word(buf,n);
	
}	
//===============================================================
/*********************************************************************************
** 函数名称: Double_Led_Charge_Control
** 编写者  ：CZM
** 函数功能：调节等离子体强度
** 输入参数：无
** 输出参数：无
** 备    注：无
*********************************************************************************/
